In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='tabledb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql='''SELECT U.userid, U.name, B.prodName, U.addr, CONCAT(U.mobile1, U.mobile2)  AS '연락처'
FROM usertbl U
  INNER JOIN buytbl B
     ON U.userid = B.userid ;'''

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0    1    2   3           4
0  EJW  은지원    책  경북  0118888888
1  EJW  은지원  청바지  경북  0118888888
2  EJW  은지원    책  경북  0118888888
3  JYP  조용필  모니터  경기  0114444444
4  KBS  김범수  청바지  경남  0112222222
5  KBS  김범수  노트북  경남  0112222222
6  KBS  김범수  운동화  경남  0112222222
7  SSK  성시경    책  서울        None

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='tabledb',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql='''SELECT * FROM v_userbuytbl WHERE name = '김범수';  '''

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0    1    2   3           4
0  KBS  김범수  운동화  경남  0112222222
1  KBS  김범수  노트북  경남  0112222222
2  KBS  김범수  청바지  경남  0112222222